app/views/admin/items/edit.html.erb

SELECT "genres".* FROM "genres"
---
    <div class="col-sm-8">
    <%= f.collection_select(:genre_id,Genre.all,:id,:name,{prompt:"--選択して下さい--"},{class:"form-control"}) %>