app/controllers/admin/customers_controller.rb

SELECT  "customers".* FROM "customers" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
     @customers=Customer.page(params[:page]).per(10)

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "customers" SET "is_active" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_active", 1], ["updated_at", "2021-07-14 09:13:24.902941"], ["id", 3]]
---
  def update
    @customer=Customer.find(params[:id])
    @customer.update(customer_params)