app/controllers/admin/genres_controller.rb

  def update
    @genre=Genre.find(params[:id])
    @genre.update(genre_params)
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "cake"], ["updated_at", "2021-07-13 15:31:15.830470"], ["id", 1]]