app/controllers/admin/homes_controller.rb

  def top
    @orders=Order.page(params[:page]).per(5)
---
SELECT  "orders".* FROM "orders" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]