app/controllers/admin/homes_controller.rb

  def top

    if params[:customer_id]
      customer = Customer.find(params[:customer_id])
      @orders = customer.orders.page(params[:page]).per(10)
    else
      @orders = Order.page(params[:page]).per(10)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."customer_id" = ? LIMIT ? OFFSET ?  [["customer_id", 5], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "orders"
SELECT  "orders".* FROM "orders" LIMIT ?  [["LIMIT", 11]]