app/controllers/admin/items_controller.rb

SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"
---
  def index
    @items=Item.page(params[:page]).per(10)

INSERT INTO "items" ("genre_id", "name", "image_id", "introduction", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item=Item.new(item_params)
    if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "items" SET "image_id" = ?, "price" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_id", "6de493a0fb65d94c5e10d11055722c5eb72aa53ee86381ba32ca0f027c4e"], ["price", 300], ["updated_at", "2021-07-27 21:45:39.993735"], ["id", 1]]
---
  def update
    @item=Item.find(params[:id])
    @item.update(item_params)