app/controllers/admin/order_items_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 2], ["updated_at", "2021-07-29 13:37:42.842693"], ["id", 2]]
UPDATE "order_items" SET "status" = ?, "updated_at" = ? WHERE "order_items"."id" = ?  [["status", 2], ["updated_at", "2021-07-29 03:37:23.798213"], ["id", 10]]
SELECT COUNT(*) FROM "order_items" WHERE "order_items"."status" = ? AND "order_items"."order_id" = ?  [["status", 3], ["order_id", 2]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "order_items" SET "status" = ?, "updated_at" = ? WHERE "order_items"."id" = ?  [["status", 1], ["updated_at", "2021-07-27 09:01:46.268383"], ["id", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 3], ["updated_at", "2021-07-29 13:41:25.917479"], ["id", 2]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 2], ["updated_at", "2021-07-29 13:41:15.304682"], ["id", 2]]
---
  def update
    @order_item=OrderItem.find(params[:id])
    @order_item.update(order_item_params)
    if OrderItem.where(status:"製作完了",order_id:@order_item.order_id).count ==  @order_item.order.order_items.count
      @order_item.order.update(status:"発送準備中")
    elsif params[:order_item][:status] == "製作中"
      @order_item.order.update(status:"製作中")