app/controllers/admin/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
---
  def show
    @order=Order.find(params[:id])
    @order_items=OrderItem.where(order_id:@order.id)

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 1], ["updated_at", "2021-07-27 08:46:04.902118"], ["id", 2]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ? AND "order_items"."order_id" = ?  [["order_id", 2], ["order_id", 2]]
UPDATE "order_items" SET "status" = ?, "updated_at" = ? WHERE "order_items"."id" = ?  [["status", 1], ["updated_at", "2021-07-29 13:41:10.496436"], ["id", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 1], ["updated_at", "2021-07-29 10:54:57.896312"], ["id", 2]]
---
  def update
    order=Order.find(params[:id])
    if params[:order][:status] == "入金確認"
      order.update(order_params)
      order.order_items.each do |order_item|
        order_item.update(status: "製作待ち")
      end
    else
        order.update(order_params)