app/views/admin/orders/show.html.erb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 2]]
---
        <tr>
          <td><%= order.order_items.item.name %></td>
          <td><%= order.order_items.price %></td>