app/views/admin/homes/top.html.erb

            <td><%= order.customer.full_name %></td>
            <td><%= order.order_items.sum(:amount) %></td>
---
SELECT SUM("order_items"."amount") FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]