app/views/public/addresses/index.html.erb

        </thead>
        <% current_customer.addresses.each do |address| %>
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."customer_id" = ?  [["customer_id", 11]]