app/controllers/public/addresses_controller.rb

  def create
    @address=Address.new(address_params)
    @address.save
---
INSERT INTO "addresses" ("customer_id", "name", "postal_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 8], ["name", "ひつじ仙人ver2"], ["postal_code", "9990000"], ["address", "山梨県"], ["created_at", "2021-07-25 23:18:10.828136"], ["updated_at", "2021-07-25 23:18:10.828136"]]

  def update
    @address=Address.find(params[:id])
    @address.update(address_params)
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "addresses" SET "name" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["name", "ひつじ仙人ver3"], ["updated_at", "2021-07-25 23:18:41.690383"], ["id", 2]]