app/controllers/public/cart_items_controller.rb

SELECT  "cart_items".* FROM "cart_items" LIMIT ?  [["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ? LIMIT ?  [["customer_id", 1], ["LIMIT", 1]]
SELECT SUM(price) FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 4]]
---
  def index
    @cart_item=CartItem.find()
    @cart_items=CartItem.where(customer_id:current_customer.id)