app/controllers/public/cart_items_controller.rb

  def update
    @cart_item=CartItem.find(params[:id])
    if @cart_item.update(cart_item_params)
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 2], ["updated_at", "2021-07-28 23:43:57.592453"], ["id", 26]]

  def destroy
    @cart_item=CartItem.find(params[:id])
    @cart_item.destroy
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 3]]

  def empty
    @cart_items.destroy_all
---
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 3]]

  def create
    @cart_item=CartItem.new(cart_item_params)
    if @cart_item.save!
---
INSERT INTO "cart_items" ("item_id", "customer_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 4], ["customer_id", 7], ["amount", 1], ["created_at", "2021-07-27 09:27:58.561989"], ["updated_at", "2021-07-27 09:27:58.561989"]]

  def set_cart_item
    @cart_item=CartItem.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]