app/controllers/public/customers_controller.rb

UPDATE "customers" SET "is_active" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_active", 0], ["updated_at", "2021-07-25 22:19:12.388565"], ["id", 8]]
---
  def withdraw
    current_customer.update(is_active: false)