app/controllers/public/homes_controller.rb

SELECT "genres".* FROM "genres"
SELECT "items".* FROM "items" ORDER BY "DESC" ASC
---
  def top
    @genres=Genre.all
    @items=Item.all.order(:DESC)