app/controllers/public/items_controller.rb

SELECT "genres".* FROM "genres"
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."genre_id" = ? LIMIT ? OFFSET ?  [["genre_id", 1], ["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "items" WHERE "items"."genre_id" = ? LIMIT ? OFFSET ?) subquery_for_count  [["genre_id", 1], ["LIMIT", 8], ["OFFSET", 0]]
---
  def index
    @genres=Genre.all
    if params[:genre_id]
      @genre=Genre.find(params[:genre_id])
      @items=@genre.items.page(params[:page]).per(8)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "genres".* FROM "genres"
---
  def show
    @item=Item.find(params[:id])
    @tax=1.1
    @genres=Genre.all