app/controllers/public/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."order_id" = ?  [["order_id", 2]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 2]]
---
  def show
    @order=Order.find(params[:id])
    @order_items=OrderItem.where(order_id: @order.id)

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 6]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def confirm
    @order=Order.new(order_params)
    @cart_items=current_customer.cart_items
    if params[:order][:address_option] == "0"
      @order.postal_code=current_customer.postal_code
      @order.order_address=current_customer.address
      @order.name=current_customer.full_name
    elsif params[:order][:address_option] == "1"
      @address_id=params[:order][:order_add]
      @address_info=Address.find(id=@address_id)
      @order.postal_code=@address_info.postal_code
      @order.order_address=@address_info.address

INSERT INTO "orders" ("customer_id", "postal_code", "name", "postage", "payment", "total_price", "created_at", "updated_at", "order_address") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 11]]
INSERT INTO "order_items" ("order_id", "item_id", "amount", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 8], ["item_id", 2], ["amount", 1], ["price", 900], ["created_at", "2021-07-29 00:41:34.143165"], ["updated_at", "2021-07-29 00:41:34.143165"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 30]]
---
  def create
    @order=Order.new(order_params)
    if @order.save
    current_customer.cart_items.each do |cart_item|
      @order_item=OrderItem.new
      @order_item.amount=cart_item.amount
      @order_item.price=cart_item.item.price
      @order_item.order_id=@order.id
      @order_item.item_id=cart_item.item_id
      @order_item.save
    end
    current_customer.cart_items.destroy_all