app/views/public/cart_items/index.html.erb

SELECT  "cart_items".* FROM "cart_items" LIMIT ?  [["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    </thead>
    <% @cart_items.item.each do |item|%>