app/views/public/orders/index.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 8]]
---
      </thead>
      <% current_customer.orders.each do |order| %>

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 2]]
---
        </td>
        <td><% order.order_items.each do |order_item| %>